{
    "General": {
        "spring": "Spring",
        "summer": "Summer",
        "fall": "Fall",
        "winter": "Winter",
        "read_more": "Read More",
        "learn_more": "Learn More"
    },
    "Locale": {
        "Kr": "KR",
        "En": "EN"
    },
    "Shortcuts": {
        "Courses": "Courses",
        "Research Labs": "Research Labs",
        "Notice": "Notice",
        "Events": "Events",
        "Graduate_Program": "Graduate Program"
    },
    "Menu": {
        "Home": "Home",
        "ArticleList": "All News",
        "Highlights": "Highlights",
        "Education": "Education",
        "Undergraduate": "Undergraduate",
        "Master": "Master",
        "PhD": "Doctoral",
        "International": "International Exchange Program",
        "Research": "Research",
        "People": "People",
        "About": "About"
    },
    "Education": {
        "Undergraduate": {
            "summary": "In the undergraduate course, students acquire the basic qualities of designers necessary for design practice. Students learn the history and the present state of design, including formative principles and visual language. They also cultivate various expression abilities. Based on understanding modern industrial systems, students can carry out product design and digital media design projects focusing on marketing and production. Students develop creative problem-solving abilities and design practical skills through completing various products.",
            "graduationResearch": "Graduation Research",
            "graduationResearchDescription": "For advanced major or students who are following major course requirements in 2015 or earlier, Graduation Design Studio I and II aligned with Graduation Research are mandatory; therefore, they cannot replace their Graduation Research with URP-B.",
            "URP-B": "Students who are not belonging to either of the above category (i.e. students who are following major course requirements in 2016 or later, and not advanced major) can apply URP-B for their research credit.",
            "graduationRequirements": "Requisites for Graduation",
            "graduationRequirementsReadThis": "Read this link",
            "Admission": "Undergraduate students at KAIST start without their major department. At the end of the 2nd semester, students choose a major. Since 2016, KAIST undergraduate students are required to choose double majors or in-depth major of one department. Thus, students can choose industrial design as an in-depth major, a minor, or the first or the second major of double major. About 830 students enter the undergraduate program each year. In April of one year before the starting semester, admission plan and details are released. Please refer to <1>KAIST admission homepage</1> for more details."
        },
        "Master": {
            "summary": "The Master of Science Program is constructed around the academic exploration of the design discipline and its application and methods. Through various collaborative projects with industry, the ability to exercise and manage design projects is strengthened. Individual studies concerning high-level theories and practical application are practiced to acquire skills applicable to practical business.",
            "thesisRequirementTitle": "MSc. Thesis Requirement",
            "thesisRequirementContent": "Additionally, master's level research project is required. The research contents should contribute to the design practice or the body of knowledge in the field of design. It also should be original and address the practical design or research issues in the design discipline.",
            "admissionTitle": "Admission",
            "admissionContent": "Graduate students of design-related majors, such as industrial design, industrial art, information design, and multimedia, as well as architecture, industrial engineering, and management, are eligible for admission.The first-year students of the master’s program are categorized into those receiving national scholarships, KAIST scholarships, and public scholarships. In the first part of the admissions procedure, documents and proficiency test scores (including English scores from exams such as the TOEFL, TOEIC, and TEPS) are evaluated, and the second part of the admissions procedure requires an interview that includes an exam on industrial design theories and a presentation with a design portfolio and presentation media.",
            "applicationTitle": "Requirements for Application"
        },
        "PhD": {
            "summary": "The Ph.D. program offers in-depth research opportunities for systematically creating design knowledge. High-level theories on digital media and content design, artificial environment system design, human-centered interaction design, creative design, and design strategy are discussed and applied. Under the umbrella of this knowledge, in-depth design research is carried out to contribute to the body of knowledge in the design field. A combined MS/Ph.D. program is also offered to allow for a smooth and continuous development from the BS to the MS to the Ph.D.",
            "thesisRequirementTitle": "Ph.D. Thesis Requirement",
            "thesisRequirementContent": "A Ph.D.-level research project based on a research proposal confirmed by the student's supervisor is required. The research should significantly contribute to the body of knowledge in the field of design. The dissertation also should be original and address an important design or research problem within the field of design or related disciplines.",
            "admissionTitle": "Admission",
            "admissionContent": "Graduate students of design related majors, such as Industrial design, industrial art, information design, multimedia, etc., and architecture, industrial engineering, management, etc. are applicable. The freshmen of the Ph.D. program are divided into national scholarship student, KAIST scholarship student, and public scholarship student. The first part of the admission procedure examines documents (TOEFL, TOEIC, TEPS, etc. English score included) and the second part requires an interview that includes an exam on industrial design theories and a presentation with a design portfolio and presentation media.",
            "applicationTitle": "Requirements for Application"
        }
    },
    "CurriculumHandbook": "Industrial design education has originally started with the practice for primarily dealing with theaesthetic shaping of mass-produced products, and now has developed into the exploration ofthe intrinsic desires and values of human beings. It includes activities to creatively propose andrefine the concept of new products and services that can not only satisfy them but also influencethe society. KAIST Industrial Design Department, for the first time in Korea, has introduceddesign education that integrates science and technology with aesthetics and human-centereddesign thinking. In the era of the 4th Industrial Revolution, we are carrying out education andresearch to foster design practitioners who understand and can deal with state-of-the-arttechnology and business possibilities for their designs, and design researchers who can leadcreative innovation and provide inspiration to design community through which they can offernew design paradigm. \n The undergraduate course focuses on educating entrepreneurial designers who can identify newhuman-centered problems, find creative solutions, and embody them in aestheticallyconsiderable business possibilities. To this end, we focus on the high-tech knowledge and skilleducation that enables integrated design thinking and outcomes, education on human and socialunderstanding methods for fundamental human value-based design beyond merely usability,and knowledge and practical skills training for innovative commercialization of design ideas.Through the postgraduate courses, we pursue to educate design researchers who can producethe world's first and best design and/or research achievements, ultimately providing a newdesign paradigm and leading education. The design and research achievements of thisdepartment have not stopped at the traditional design research paradigm, but have continuedto propose and lead new design research topics. In particular, the research activities of thisdepartment in HCI (Human-Computer Interaction), UX (User Experience), and interactive mediadesign have shown remarkable results globally. It also leads the fields of design-led start-up andsocial innovation through design. \n ID KAIST curriculum book summarizes how these visions are integrated into our curriculum indetail. It first overviews our education goals and principles, and the courses for undergraduateand postgraduate programs are provided. We include the explanation of the course’s objective,teaching methods, and student examples for every course. We hope that this curriculum booknot only helps readers capture the ID KAIST education vision, but also helps both our currentand prospective students understand the overall flow of the curriculum with each course’spurpose for their learning at ID KAIST.",
    "Research": {
        "overview": "We are leading design professionals and researchers who create new user experiences through their understanding of cutting-edge technology and the ability to identify user needs and initiate business innovation. They contribute in diverse areas through mindsets and methods that allow them to view problems, (re)frame them, and deal with ambiguity in systematic ways. Research Labs are grouped by three areas: Human-Centered Design, New Technology Convergence, and Business Innovation.",
        "LabList": {
            "scrollMessage": "SCROLL TO SEE MORE LABS"
        }
    },
    "People": {
        "role": {
            "All": "All",
            "Faculty": "Faculty",
            "OldFaculty": "Emeritus",
            "Staff": "Staff",
            "OtherFaculty": "Affiliated Faculty"
        },
        "position": {
            "Professor": "Professor",
            "Associate Professor": "Associate Professor",
            "Assistant Professor": "Assistant Professor",
            "Emeritus Professor": "Emeritus Professor",
            "Administrative Staff": "Administrative Staff",
            "Department Coordinator": "Department Coordinator",
            "BK Staff": "BK Staff",
            "Engineer": "Engineer",
            "Technician": "Technician"
        }
    },
    "About": {
        "tabs": {
            "Mission": "Mission",
            "History": "History",
            "Reputation": "Reputation",
            "Contact": "Contact"
        },
        "Mission": "The Department of Industrial Design at KAIST (ID KAIST) was founded in 1986, as the first design department established in a College of Engineering in the Republic of Korea. It started with an undergraduate degree, later followed by a Master (1991) and a Doctoral (2002) program. While it initially focused on design education and research rooted in product design, the scope of the department has gradually expanded to user interface design, interaction design, user experience design, service, and system design, society, and business innovation design, and Human-Computer Interaction (HCI). With the doctoral program achieving maturity in the mid-2000s, the department began to produce strong and unique research results published in renewed international venues. Today, ID KAIST is internationally recognized as a leading department in the field of HCI, interaction design, and user experience design. The education program of ID KAIST focuses on training designers and design researchers in order to solve important problems faced by the industry and society. This is achieved by encouraging innovative, integrated, and aesthetic methods of explorations, that aim to deeply understand people, technology, business, and society. Following this path, ID KAIST has held since 2016 the Design 3.0 Forum, an annual international event that explores new possibilities for design education and research in the era of the 4th Industrial Revolution. Looking ahead to the future, ID KAIST aims to create a positive and sustainable impact that enables a better life and future for the whole of mankind, through human-centered research and education.",
        "Address": "Bldg. N25, 291 Daehak-ro, Yuseong-gu, Daejeon 34141, Republic of Korea"
    },
    "ArticleList": {
        "Type":{
            "All":"All",
            "Award":"Award",
            "Event":"Event",
            "News":"News",
            "Notice":"Notice",
            "Banner": "Banner"
        },
        "NoArticleMsg": "Loading... Or, there is no article of the type"
    }
}